[
    {
        "nome_ensino": "Aulas de Codificação",
        "lider": "Clyeton",
        "vice_lider": "ednaldo",
        "contato": "ednaldo@gmail.com",
        "descricao": "**Aulas de Codificação: Uma Ferramenta Transformadora para o Ensino de Tecnologia**  \r\n\r\nAs Aulas de Codificação são iniciativas educacionais que visam despertar o interesse por tecnologia e programação em um ambiente colaborativo e prático. Essas aulas oferecem um espaço onde estudantes, independentemente de sua experiência prévia, podem aprender a criar códigos e desenvolver projetos tecnológicos de maneira divertida e estimulante.  \r\n\r\nA principal proposta das Aulas de Codificação é ensinar conceitos de programação de forma acessível, utilizando linguagens como Python, JavaScript, ou até ferramentas visuais como Scratch, dependendo da faixa etária e nível de conhecimento dos participantes. O aprendizado ocorre por meio de desafios práticos, criação de jogos, aplicativos ou sites, além de atividades que exploram resolução de problemas e lógica computacional.  \r\n\r\nAlém de promover habilidades técnicas, as Aulas de Codificação desenvolvem competências fundamentais para o século XXI, como pensamento crítico, criatividade, trabalho em equipe e capacidade de resolução de problemas. Essas aulas também são uma oportunidade para os alunos explorarem suas ideias de forma autônoma, trabalhando em projetos que refletem seus interesses pessoais.  \r\n\r\nOutra vantagem das Aulas de Codificação é a possibilidade de criar uma comunidade engajada, onde os participantes podem compartilhar conhecimento, ajudar uns aos outros e construir um portfólio de projetos. Esse tipo de experiência não apenas prepara os jovens para as demandas do mercado de trabalho futuro, mas também contribui para aumentar a representatividade em áreas de tecnologia, incentivando a inclusão de meninas e grupos sub-representados.  \r\n\r\nCom o avanço da tecnologia, iniciativas como as Aulas de Codificação tornam-se indispensáveis para preparar as próximas gerações para um mundo cada vez mais digital, conectando educação, inovação e criatividade.",
        "foto": "programacao.png"
    }
]